In [1]:
#import some stuff
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
from wrangle import get_telco_charge_data, wrangle_telco

In [2]:
#let's get our data! It's going to be customer_id, monthly_charges, tenure, and total_charges 
# for customers with 2 year contracts
df = get_telco_charge_data()

In [3]:
#making sure it looks as it would on SQL
df.head()

  customer_id  monthly_charges  tenure total_charges
0  0002-ORFBO            65.60       9         593.3
1  0020-JDNXP            61.25      34        1993.2
2  0022-TCJCI            62.70      45        2791.5
3  0068-FIGTF            78.20      27       2078.95
4  0074-HDKDG            61.60      25          1611

In [4]:
#checking info, I'm going to check for nulls and also change total_charges to a numeric d-type.
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1473 entries, 0 to 1472
Data columns (total 4 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   customer_id      1473 non-null   object
 1   monthly_charges  1473 non-null   float64
 2   tenure           1473 non-null   int64
 3   total_charges    1473 non-null   object
dtypes: float64(1), int64(1), object(2)
memory usage: 46.2+ KB

In [5]:
#replace special blanks with NaN
df = df.replace(r'^\s*$', np.NaN, regex=True)

In [7]:
#1 entry in total_charges is NaN
df.isna().sum()

customer_id        0
monthly_charges    0
tenure             0
total_charges      1
dtype: int64

In [8]:
#change total_charges to numeric, and then filled in NaN value with mean of total_charges
df.total_charges = pd.to_numeric(df.total_charges, errors='coerce').astype('float64')
df.total_charges = df.total_charges.fillna(value=df.total_charges.mean()).astype('float64')

In [9]:
#checking to make sure the value was filled in
df.isna().sum()

customer_id        0
monthly_charges    0
tenure             0
total_charges      0
dtype: int64

In [11]:
#checking to make sure the info looks good
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1473 entries, 0 to 1472
Data columns (total 4 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   customer_id      1473 non-null   object
 1   monthly_charges  1473 non-null   float64
 2   tenure           1473 non-null   int64
 3   total_charges    1473 non-null   float64
dtypes: float64(2), int64(1), object(1)
memory usage: 46.2+ KB

In [2]:
#restarted kernal, testing out this cool wrangle_telco to see if it works!
df = wrangle_telco()

In [3]:
#oooh it's working
df.head()

  customer_id  monthly_charges  tenure  total_charges
0  0002-ORFBO            65.60       9         593.30
1  0020-JDNXP            61.25      34        1993.20
2  0022-TCJCI            62.70      45        2791.50
3  0068-FIGTF            78.20      27        2078.95
4  0074-HDKDG            61.60      25        1611.00

In [4]:
#eeeeeeee the total_charges are a float!!!
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1473 entries, 0 to 1472
Data columns (total 4 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   customer_id      1473 non-null   object
 1   monthly_charges  1473 non-null   float64
 2   tenure           1473 non-null   int64
 3   total_charges    1473 non-null   float64
dtypes: float64(2), int64(1), object(1)
memory usage: 57.5+ KB

In [5]:
#I'm so excited
df.isna().sum()

customer_id        0
monthly_charges    0
tenure             0
total_charges      0
dtype: int64